Задача:
В ранее созданном репозитории создайте приложение task2.
В папке проекта создайте папку для шаблонов (templates), в ней ещё одну - second_task.
В этой папке создайте 2 HTML шаблона со следующими записями: "Это шаблон для классового представления" и "Это шаблон для функционального представления".
В представлениях (views) приложения task2 создайте представления: одно классовое, а другое функциональное, которые отображают шаблоны с соответствующими надписями. Названия для представлений можете определить самостоятельно.
Создайте маршруты к созданным представлениям.
Запустите сервер и проверьте его на работоспособность.
